## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/15018713312)



<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0]
  * module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"]
* Update
  * module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]
  * module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0] will be updated in-place
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules"
        name                   = "dev-kyma-modules"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] will be updated in-place
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }

        # (2 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] will be created
  + resource "google_artifact_registry_repository" "unprotected_repository" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dockerhub-mirror"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "REMOTE_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dockerhub-mirror"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + remote_repository_config {
          + description = "Remote repository mirroring Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }

          + upstream_credentials {
              + username_password_credentials {
                  + password_secret_version = "projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1"
                  + username                = "sapcom"
                }
            }
        }
    }

  # module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-05-13T13:19:15.767591Z" -> "2025-05-14T10:22:25.809882Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2025-05-13T13:19:15.767591Z" -> "2025-05-14T10:22:25.809882Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2025-05-14T10:16:43.268762Z" -> "2025-05-14T10:46:38.856514Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2025-05-14T10:17:56.436364Z" -> "2025-05-14T10:18:32.416137Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2025-05-14T10:17:54.330103Z" -> "2025-05-14T10:20:54.543885Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13050,"Program":"tfcmt","SHA1":"a07475ca486425784fcbd4da9bd65ed597a0f067","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->